In [1]:
import pandas as pd

In [13]:
data = [['AMY', 13, 'girl'],
        ['BEN', 13, 'boy'],
        ['EVA', 14, 'girl'],
        ['KIM', 14, 'girl'],
        ['NEO', 14, 'boy']]

In [15]:
df = pd.DataFrame(data, columns=['Name', 'Age', 'Gender'])

In [16]:
df

  Name  Age Gender
0  AMY   13   girl
1  BEN   13    boy
2  EVA   14   girl
3  KIM   14   girl
4  NEO   14    boy

In [17]:
data = {
    'Name' : ['AMY', 'BEN', 'EVA', 'KIM', 'NEO'],
    'Age' : [13, 13, 14, 14, 14],
    'Gender' : ['girl', 'boy', 'girl', 'girl', 'boy']
}

In [18]:
df = pd.DataFrame(data)

In [19]:
df

  Name  Age Gender
0  AMY   13   girl
1  BEN   13    boy
2  EVA   14   girl
3  KIM   14   girl
4  NEO   14    boy

In [20]:
print(df['Name'])

0    AMY
1    BEN
2    EVA
3    KIM
4    NEO
Name: Name, dtype: object

In [23]:
print(df.iloc[1])

Name      BEN
Age        13
Gender    boy
Name: 1, dtype: object

In [25]:
print(df.loc[3])

Name       KIM
Age         14
Gender    girl
Name: 3, dtype: object

In [28]:
print(df.at[1, 'Name'])

BEN

In [30]:
df['City'] = ['New York', 'Los Angeles', 'Chicago', 'New York', 'Chicago']
print(df)

  Name  Age Gender         City
0  AMY   13   girl     New York
1  BEN   13    boy  Los Angeles
2  EVA   14   girl      Chicago
3  KIM   14   girl     New York
4  NEO   14    boy      Chicago

In [31]:
print(df.describe())

             Age
count   5.000000
mean   13.600000
std     0.547723
min    13.000000
25%    13.000000
50%    14.000000
75%    14.000000
max    14.000000

In [37]:
df.info

<bound method DataFrame.info of   Name  Age Gender         City
0  AMY   13   girl     New York
1  BEN   13    boy  Los Angeles
2  EVA   14   girl      Chicago
3  KIM   14   girl     New York
4  NEO   14    boy      Chicago>

In [42]:
print(df[['Name', 'Age', 'Gender']])

  Name  Age Gender
0  AMY   13   girl
1  BEN   13    boy
2  EVA   14   girl
3  KIM   14   girl
4  NEO   14    boy

In [43]:
print(df.iloc[0:2])

  Name  Age Gender         City
0  AMY   13   girl     New York
1  BEN   13    boy  Los Angeles

In [47]:
print(df.loc[1, 'Name'])

BEN

In [53]:
filtered_df = df[df['Age'] > 13]['Name']

In [54]:
print(filtered_df)

2    EVA
3    KIM
4    NEO
Name: Name, dtype: object

In [69]:
d = df.copy()

In [70]:
d

  Name  Age Gender         City
0  AMY   13   girl     New York
1  BEN   13    boy  Los Angeles
2  EVA   14   girl      Chicago
3  KIM   14   girl     New York
4  NEO   14    boy      Chicago

In [76]:
d[['Name', 'Age']]

  Name  Age
0  AMY   13
1  BEN   13
2  EVA   14
3  KIM   14
4  NEO   14

In [73]:
d[d['Age']==13]['Name']

0    AMY
1    BEN
Name: Name, dtype: object